//--------------------------------------------------------------
// 
// codeBlock
// 

// 
// /codeBlock
// 
//--------------------------------------------------------------

分隔各逻辑代码段是个好习惯，可以在快速浏览代码时迅速分辨出逻辑块。
不要使用编程语言自带的代码块功能，如 C# 的 #region 块。

/*--------------------------------------------------------------
 *
 * codeBlock
 *
 */

#--------------------------------------------------------------
#
# codeBlock
#

variable, Variables - 变量

field, Fields - 字段

property, Properties - 属性

method, Methods - 方法

constructor, Constructors - 构造函数


--------------------------------------------------------------
下面列出了用匈牙利类型标记法定义 ECMAScript 变量使用的前缀，
本书都采用这些前缀，以使示例代码更易于阅读。

--------------------------------------------------------------
类型                        前缀               示例
--------------------------------------------------------------
数组                        a                  aValue
布尔型                      b                  bFound
浮点型（数字）              f                  fValue
函数                        fn                 fnMethod
整型（数字）                i                  iValue
对象                        o                  oType
正则表达式                  re                 rePattern
字符串                      s                  sValue
变型（可以是任何类型）      v                  vValue
datetime                    d                  dDatetime


--------------------------------------------------------------
